#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

google_storage_bucket.pdfta_shop_bucket: Refreshing state... [id=pfdta-shop-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.shop_datawarehouse will be created
  + resource "google_cloud_run_v2_service" "shop_datawarehouse" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west2"
      + name                    = "shop-datawarehouse"
      + observed_generation     = (known after apply)
      + project                 = "pdfta-shop-data"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "shop-datawarehouse-sa@pdfta-shop-data.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "europe-west2-docker.pkg.dev/PROJECT_ID/shop-datawarehouse/api:latest"

              + env {
                  + name  = "GCP_PROJECT_ID"
                  + value = "pdfta-shop-data"
                }
              + env {
                  + name  = "GCS_BUCKET_NAME"
                  + value = "pfdta-shop-bucket"
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 10
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 0
                  + period_seconds        = 3
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = (known after apply)
                    }
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_project_service.artifact_registry_api will be created
  + resource "google_project_service" "artifact_registry_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "pdfta-shop-data"
      + service            = "artifactregistry.googleapis.com"
    }

  # google_project_service.cloud_run_api will be created
  + resource "google_project_service" "cloud_run_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "pdfta-shop-data"
      + service            = "run.googleapis.com"
    }

  # google_project_service.iam_api will be created
  + resource "google_project_service" "iam_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "pdfta-shop-data"
      + service            = "iam.googleapis.com"
    }

  # google_service_account.cloud_run_sa will be created
  + resource "google_service_account" "cloud_run_sa" {
      + account_id   = "shop-datawarehouse-sa"
      + disabled     = false
      + display_name = "Shop Data Warehouse Cloud Run Service Account"
      + email        = "shop-datawarehouse-sa@pdfta-shop-data.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:shop-datawarehouse-sa@pdfta-shop-data.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "pdfta-shop-data"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.pdfta_shop_bucket must be replaced
-/+ resource "google_storage_bucket" "pdfta_shop_bucket" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "pfdta-shop-bucket" -> (known after apply)
      ~ location                    = "EU" -> "EUROPE-WEST2" # forces replacement
        name                        = "pfdta-shop-bucket"
      ~ project_number              = 67703303677 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/pfdta-shop-bucket" -> (known after apply)
      ~ time_created                = "2026-02-06T12:08:38.918Z" -> (known after apply)
      ~ updated                     = "2026-02-06T12:08:38.918Z" -> (known after apply)
      ~ url                         = "gs://pfdta-shop-bucket" -> (known after apply)
        # (7 unchanged attributes hidden)

      - hierarchical_namespace {
          - enabled = false -> null
        }

      ~ lifecycle_rule {
          - condition {
              - age                                     = 90 -> null
              - days_since_custom_time                  = 0 -> null
              - days_since_noncurrent_time              = 0 -> null
              - matches_prefix                          = [] -> null
              - matches_storage_class                   = [] -> null
              - matches_suffix                          = [] -> null
              - num_newer_versions                      = 0 -> null
              - send_age_if_zero                        = false -> null
              - send_days_since_custom_time_if_zero     = false -> null
              - send_days_since_noncurrent_time_if_zero = false -> null
              - send_num_newer_versions_if_zero         = false -> null
              - with_state                              = "ANY" -> null
                # (3 unchanged attributes hidden)
            }
          + condition {
              + age                    = 90
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ soft_delete_policy {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + time_created                = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + updated                     = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

      ~ website {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + time_created                = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + updated                     = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_iam_member.cloud_run_bucket_access will be created
  + resource "google_storage_bucket_iam_member" "cloud_run_bucket_access" {
      + bucket = "pfdta-shop-bucket"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:shop-datawarehouse-sa@pdfta-shop-data.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

Plan: 7 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + bucket_name               = "pfdta-shop-bucket"
  + bucket_self_link          = (known after apply)
  + bucket_url                = (known after apply)
  + cloud_run_service_account = "shop-datawarehouse-sa@pdfta-shop-data.iam.gserviceaccount.com"
  + cloud_run_service_name    = "shop-datawarehouse"
  + cloud_run_url             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jaspajjr, Action: `pull_request`*